#Read All Files
read_file -format verilog  ../src/LASER.v
#read_file -format sverilog  LASER.v
source synopsys_dc.setup
current_design LASER
link

#Setting Clock Constraints
source -echo -verbose LASER.sdc
check_design
#set high_fanout_net_threshold 0

#check and solve multiple instance porblem 
check_design 
uniquify 
set_fix_multiple_port_nets -all -buffer_constants [get_designs *] 
set case_analysis_with_logic_constants true

#solve floating point 
remove_unconnected_ports -blast_buses [get_cells * -hier] 
#remove_irregular_net_bus - restricted "A\[\]"

# set multi-core synthesis (1-16) 
set_host_options -max_core 8

# synthesis all design 
#compile -map_effort high -area_effort high
#compile
#compile -map_effort high 
#compile -incremental_mapping -map_effort high
compile_ultra

write -format ddc     -hierarchy -output "LASER_syn.ddc"
write_sdf -version 1.0  LASER_syn.sdf
write -format verilog -hierarchy -output LASER_syn.v
report_area > area.log
report_timing > timing.log
report_qor   >  LASER_syn.qor
exit
