set_max_area 0
set compile_top_all_paths true   
set_host_options -max_cores 16

#compile  
#compile -map_effort high -area_effort high  
#compile -map_effort high -area_effort high -inc  
compile_ultra  
#compile_ultra -area -timing
